Revit 2027 API
Document.GetUnits Method
 Gets the Units object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Units GetUnits()
Public Function GetUnits As Units
public:
Units^ GetUnits()
member GetUnits : unit -> Units
Return Value
Units
 The Units object.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace